export default {
  // 内科学 2024年7月 第10版
  绪论: {
    绪论: {
      绪论: {
        内科学概况: {},
        如何学习内科学: {},
      },
    },
  },
  呼吸系统疾病: {
    总论: {},
    急性上呼吸道感染和急性气管支气管炎: {
      急性上呼吸道感染: {
        // 流行性感冒: {},
      },
      急性气管支气管炎: {},
    },
    慢性阻塞性肺疾病: {
      慢性支气管炎: {},
      慢性阻塞性肺疾病: {},
    },
    支气管哮喘: {},
    支气管扩张: {},
    肺部感染性疾病: {
      肺炎概述: {},
      细菌性肺炎: {
        肺炎链球菌肺炎: {},
        葡萄球菌肺炎: {},
      },
      病毒性肺炎: {
        严重急性呼吸综合征: {},
        高致病性人禽流感病毒性肺炎: {},
        '2019冠状病毒病': {},
      },
      '肺炎支原体肺炎、衣原体肺炎与肺军团病': {
        肺炎支原体肺炎: {},
        肺炎衣原体肺炎: {},
        肺军团病: {},
      },
      肺真菌病: {
        肺念珠菌病: {},
        肺曲霉病: {},
        肺隐球菌病: {},
        肺孢子菌肺炎: {},
      },
    },
    肺脓肿: {},
    肺结核: {
      // 非结核分枝杆菌病: {},
    },
    肺癌: {},
    间质性肺疾病: {
      间质性肺疾病的分类: {},
      特发性肺纤维化: {},
      结节病: {},
      其他间质性肺疾病: {
        过敏性肺炎: {},
        嗜酸性粒细胞性肺炎: {},
        肺朗格汉斯细胞组织细胞增生症: {},
        肺淋巴管平滑肌瘤病: {},
        肺泡蛋白沉着症: {},
        特发性肺含铁血黄素沉着症: {},
      },
    },
    肺血栓栓塞症: {},
    肺动脉高压: {
      肺动脉高压的分类: {},
      特发性肺动脉高压: {},
      慢性肺源性心脏病: {},
    },
    胸膜疾病: {
      胸腔积液: {},
      气胸: {},
    },
    睡眠呼吸障碍: {
      概述: {},
      阻塞性睡眠呼吸暂停: {},
    },
    急性呼吸窘迫综合征: {},
    呼吸衰竭与呼吸支持技术: {
      概述: {},
      急性呼吸衰竭: {},
      慢性呼吸衰竭: {},
      呼吸支持技术: {
        氧疗: {},
        人工气道的建立与管理: {},
        正压机械通气: {},
        体外膜肺氧合: {},
        // 危重症医学概要: {},
        // 呼吸康复概要: {},
      },
    },
    烟草病学概要: {},
    // 推荐阅读: {},
  },
  循环系统疾病: {
    总论: {
      心脏的解剖和生理: {},
      心血管疾病的诊断: {},
      心血管疾病的治疗: {},
    },
    心力衰竭: {
      心力衰竭总论: {},
      慢性心力衰竭: {},
      急性心力衰竭: {},
    },
    心律失常: {
      概述: {},
      窦性心律失常: {
        窦性心动过速: {},
        窦性心动过缓: {},
        窦性停搏: {},
        窦房传导阻滞: {},
        病态窦房结综合征: {},
      },
      房性心律失常: {
        房性期前收缩: {},
        房性心动过速: {},
        心房扑动: {},
        心房颤动: {},
      },
      房室交界性心律失常: {
        房室交界性期前收缩: {},
        房室交界性逸搏与心律: {},
        非阵发性房室交界性心动过速: {},
        房室交界区相关的折返性心动过速: {},
      },
      室性心律失常: {
        室性期前收缩: {},
        室性心动过速: {},
        心室扑动与心室颤动: {},
      },
      // '遗传性心律失常综合征': {},
      心脏传导阻滞: {
        房室传导阻滞: {},
        室内传导阻滞: {},
      },
      抗心律失常药物的合理应用: {},
      心律失常的介入治疗和手术治疗: {
        心脏电复律与电除颤: {},
        心血管植入型电子器械: {},
        导管消融: {},
      },
    },
    动脉粥样硬化和冠状动脉粥样硬化性心脏病: {
      动脉粥样硬化: {},
      冠状动脉粥样硬化性心脏病概述: {},
      慢性冠状动脉综合征: {
        稳定型心绞痛: {},
        缺血性心肌病: {},
        隐匿型冠心病: {},
      },
      急性冠脉综合征: {
        不稳定型心绞痛和非ST段抬高型心肌梗死: {},
        急性ST段抬高型心肌梗死: {},
      },
      冠状动脉疾病的其他表现形式: {
        冠状动脉痉挛: {},
        心肌桥: {},
        微血管疾病: {},
      },
    },
    高血压: {
      原发性高血压: {},
      继发性高血压: {
        肾实质性高血压: {},
        肾血管性高血压: {},
        原发性醛固酮增多症: {},
        嗜铬细胞瘤和副神经节瘤: {},
        皮质醇增多症: {},
        主动脉缩窄: {},
      },
      心肌疾病: {
        肥厚型心肌病: {},
        扩张型心肌病: {},
        非扩张型左心室心肌病: {},
        致心律失常性右心室心肌病: {},
        限制型心肌病: {},
        心肌炎: {},
      },
      先天性心血管病: {
        成人常见先天性心血管病: {
          房间隔缺损: {},
          室间隔缺损: {},
          动脉导管未闭: {},
          卵圆孔未闭: {},
          肺动脉瓣狭窄: {},
          二叶主动脉瓣: {},
          三尖瓣下移畸形: {},
          先天性主动脉缩窄: {},
          主动脉窦瘤: {},
          冠状动脉瘘: {},
          法洛四联症: {},
          艾森门格综合征: {},
        },
        成人先天性心脏病的介入治疗: {
          经皮球囊肺动脉瓣成形术: {},
          经导管封堵术: {},
          先天性心脏病的其他介入治疗术: {},
        },
      },
      心脏瓣膜病: {
        主动脉瓣狭窄: {},
        主动脉瓣反流: {},
        二尖瓣狭窄: {},
        二尖瓣反流: {},
        多瓣膜病: {},
        风湿热: {},
      },
      心包疾病: {
        急性心包炎: {},
        心包积液及心脏压塞: {},
        缩窄性心包炎: {},
      },
      感染性心内膜炎: {},
      心脏骤停与心脏性猝死: {},
      主动脉和周围血管病: {
        主动脉夹层: {},
        下肢动脉硬化闭塞症: {},
        静脉血栓症: {},
      },
      心血管神经症: {},
      肿瘤心脏病学: {
        肿瘤治疗相关的心功能不全: {},
        肿瘤治疗相关的冠状动脉疾病: {},
        肿瘤治疗相关的心律失常: {},
        肿瘤治疗相关的高血压: {},
        肿瘤治疗相关的血栓性疾病: {},
        肿瘤治疗相关的其他心血管疾病: {},
      },
      其他心血管疾病: {
        糖尿病与高血压: {},
        糖尿病与冠心病: {},
        糖尿病与心力衰竭: {},
      },
      // '推荐阅读': {},
    },
  },
  消化系统疾病: {
    总论: {
      '常见疾病相关的消化生理、生化功能': {},
      消化系统重要诊疗技术: {},
    },
    胃食管反流病: {},
    食管癌: {},
    胃炎: {
      急性胃炎: {},
      慢性胃炎: {},
      特殊类型的胃炎或胃病: {},
    },
    消化性溃疡: {},
    胃癌: {},
    肠结核和结核性腹膜炎: {
      肠结核: {},
      结核性腹膜炎: {},
    },
    炎症性肠病: {
      溃疡性结肠炎: {},
      克罗恩病: {},
    },
    结直肠癌: {},
    功能性胃肠病: {
      功能性消化不良: {},
      肠易激综合征: {},
    },
    病毒性肝炎: {},
    脂肪性肝病: {
      非酒精性脂肪性肝病: {},
      酒精性肝病: {},
    },
    自身免疫性肝病: {
      自身免疫性肝炎: {},
      原发性胆汁性胆管炎: {},
      原发性硬化性胆管炎: {},
      IgG4相关肝胆疾病: {},
    },
    药物性肝病: {},
    肝硬化: {},
    原发性肝癌: {},
    急性肝衰竭: {},
    肝外胆系结石及炎症: {
      胆囊结石及胆囊炎: {},
      肝外胆管结石及胆管炎: {},
    },
    胆道系统肿瘤: {
      胆道系统良性肿瘤: {},
      胆道系统恶性肿瘤: {
        胆囊癌: {},
        胆管癌: {},
      },
    },
    胰腺炎: {
      急性胰腺炎: {},
      慢性胰腺炎: {},
    },
    胰腺癌: {},
    腹痛: {},
    慢性腹泻: {},
    便秘: {},
    消化道出血: {},
    // '推荐阅读': {}
  },
  泌尿系统疾病: {
    总论: {},
    原发性肾小球疾病: {
      肾小球疾病概述: {},
      急性肾小球肾炎: {},
      急进性肾小球肾炎: {},
      IgA肾病: {},
      肾病综合征: {},
      '无症状性血尿和/或蛋白尿': {},
      慢性肾小球肾炎: {},
    },
    继发性肾病: {
      狼疮性肾炎: {},
      糖尿病肾脏病: {},
      血管炎肾损害: {},
      高尿酸肾损害: {},
    },
    间质性肾炎: {
      急性间质性肾炎: {},
      慢性间质性肾炎: {},
    },
    尿路感染: {},
    肾小管疾病: {
      肾小管性酸中毒: {
        远端肾小管酸中毒: {},
        近端肾小管酸中毒: {},
        混合型肾小管酸中毒: {},
        高血钾型肾小管酸中毒: {},
      },
      Fanconi综合征: {},
    },
    肾血管疾病: {
      肾动脉狭窄: {},
      肾动脉栓塞和血栓形成: {},
      小动脉性肾硬化症: {
        良性小动脉性肾硬化症: {},
        恶性小动脉性肾硬化症: {},
      },
      肾静脉血栓形成: {},
    },
    遗传性肾病: {
      常染色体显性遗传性多囊肾病: {},
      Alport综合征: {},
    },
    急性肾损伤: {},
    慢性肾衰竭: {},
    肾脏替代治疗: {},
    // '推荐阅读': {}
  },
  血液系统疾病: {
    总论: {},
    贫血概述: {},
    缺铁性贫血: {},
    巨幼细胞贫血: {},
    再生障碍性贫血: {},
    溶血性贫血: {
      概述: {},
      遗传性球形红细胞增多症: {},
      '红细胞葡萄糖-6-磷酸脱氢酶缺乏症': {},
      血红蛋白病: {
        珠蛋白生成障碍性贫血: {},
        异常血红蛋白病: {},
      },
      自身免疫性溶血性贫血: {
        温抗体型AIHA: {},
        冷抗体型AIHA: {},
      },
      阵发性睡眠性血红蛋白尿症: {},
    },
    白细胞减少和粒细胞缺乏症: {},
    骨髓增生异常性肿瘤: {},
    白血病: {
      概述: {},
      急性白血病: {},
      慢性髓系白血病: {},
      慢性淋巴细胞白血病: {},
    },
    淋巴瘤: {
      霍奇金淋巴瘤: {},
      非霍奇金淋巴瘤: {},
    },
    多发性骨髓瘤: {},
    骨髓增殖性肿瘤: {
      真性红细胞增多症: {},
      原发性血小板增多症: {},
      原发性骨髓纤维化: {},
    },
    脾功能亢进: {},
    出血性疾病概述: {},
    紫癜性疾病: {
      过敏性紫癜: {},
      原发免疫性血小板减少症: {},
      血栓性血小板减少性紫癜: {},
    },
    凝血障碍性疾病: {
      血友病: {},
      血管性血友病: {},
    },
    弥散性血管内凝血: {},
    血栓性疾病: {},
    输血和输血反应: {},
    造血干细胞移植: {},
    'CAR-T细胞免疫疗法在血液病中的应用': {},
    // '推荐阅读': {}
  },
  内分泌和代谢性疾病: {
    总论: {
      内分泌学原理: {
        内分泌系统: {},
        激素: {},
        代谢: {},
      },
      内分泌和代谢性疾病的诊断: {
        临床表现: {},
        功能诊断: {},
        定位诊断: {},
        病因诊断: {},
      },
      内分泌和代谢性疾病的治疗: {
        内分泌腺功能亢进的治疗: {},
        内分泌腺功能减退的治疗: {},
      },
    },
    下丘脑疾病: {
      下丘脑的解剖结构与功能: {},
      下丘脑相关疾病: {},
    },
    垂体前叶疾病: {
      垂体瘤: {},
      催乳素瘤: {},
      肢端肥大症和巨人症: {},
      腺垂体功能减退症: {},
      生长激素缺乏性矮小症: {},
    },
    垂体后叶疾病: {
      尿崩症: {},
      抗利尿不适当综合征: {},
    },
    甲状腺疾病: {
      甲状腺功能亢进症: {},
      甲状腺功能减退症: {},
      甲状腺炎: {},
      甲状腺肿: {},
      甲状腺结节和甲状腺癌: {
        甲状腺结节: {},
        甲状腺癌: {},
      },
    },
    甲状旁腺疾病: {
      甲状旁腺功能亢进症: {},
      甲状旁腺功能减退症: {},
    },
    肾上腺疾病: {
      库欣综合征: {},
      原发性醛固酮增多症: {},
      原发性慢性肾上腺皮质功能减退症: {},
      先天性肾上腺皮质增生症: {
        '21-羟化酶缺乏症': {},
        '11β-羟化酶缺乏症': {},
        '3β-羟类固醇脱氢酶缺陷症': {},
        '17α-羟化酶缺陷症': {},
        先天性类脂性肾上腺增生: {},
        先天性肾上腺皮质增生症的治疗: {},
      },
      嗜铬细胞瘤: {},
    },
    糖尿病: {
      糖尿病: {},
      糖尿病酮症酸中毒: {},
      高渗高血糖综合征: {},
    },
    低血糖症与胰岛素瘤: {
      低血糖症: {},
      胰岛素瘤: {},
    },
    血脂异常性疾病: {},
    肥胖症: {
      代谢综合征: {},
    },
    '水、电解质代谢和酸碱平衡失常': {
      '水、钠代谢失常': {
        失水: {},
        水过多和水中毒: {},
        低钠血症: {},
        高钠血症: {},
      },
      钾代谢失常: {
        钾缺乏和低钾血症: {},
        高钾血症: {},
      },
      酸碱平衡失常: {
        代谢性酸中毒: {},
        代谢性碱中毒: {},
        呼吸性酸中毒: {},
        呼吸性碱中毒: {},
        混合型酸碱平衡障碍: {},
      },
    },
    高尿酸血症: {},
    骨质疏松症: {},
    性发育异常疾病: {
      性染色体异常疾病: {
        Klinefelter综合征: {},
        Turner综合征: {},
      },
      '46，XY性发育异常': {
        睾丸发育障碍: {},
        'LH/HCG受体功能缺陷': {},
        雄激素合成异常: {},
        雄激素作用异常: {},
      },
      '46，XX性发育异常': {
        卵巢发育异常: {},
        雄激素过多: {},
      },
    },
    多内分泌腺体疾病: {
      多发性内分泌腺瘤病: {
        多发性内分泌腺瘤病1型: {},
        多发性内分泌腺瘤病2型: {},
      },
      自身免疫性多内分泌腺综合征: {
        '1型自身免疫性多内分泌腺综合征': {},
        '2型自身免疫性多内分泌腺综合征': {},
      },
    },
    神经内分泌肿瘤: {},
    异位激素分泌综合征: {},
    // '推荐阅读': {}
  },
  风湿免疫病: {
    总论: {},
    类风湿关节炎: {},
    系统性红斑狼疮: {},
    干燥综合征: {},
    脊柱关节炎: {
      总论: {},
      强直性脊柱炎: {},
    },
    系统性血管炎: {
      概论: {},
      大动脉炎: {},
      巨细胞动脉炎: {},
      结节性多动脉炎: {},
      ANCA相关血管炎: {},
      贝赫切特病: {},
    },
    特发性炎症性肌病: {},
    系统性硬化症: {},
    痛风: {},
    骨关节炎: {},
    IgG4相关性疾病: {},
    抗磷脂综合征: {},
    成人斯蒂尔病: {},
    复发性多软骨炎: {},
    风湿热: {},
    纤维肌痛综合征: {},
    // '推荐阅读': {}
  },
  理化因素所致疾病: {
    总论: {},
    中毒: {
      概述: {},
      农药中毒: {
        急性有机磷杀虫药中毒: {},
        急性百草枯中毒: {},
        氨基甲酸酯类杀虫剂中毒: {},
        灭鼠药中毒: {},
      },
      急性毒品中毒: {},
      急性乙醇中毒: {},
      镇静催眠药中毒: {},
      急性一氧化碳中毒: {},
      急性亚硝酸盐中毒: {},
      有机溶剂中毒: {},
      毒蛇咬伤中毒: {},
    },
    中暑: {},
    冻僵: {},
    高原病: {},
    淹溺: {},
    电击: {},
    // '推荐阅读': {}
  },
  // 中英文名词对照索引
  // 【数字特色：AR模型】
  // AR模型1 气管、支气管、肺结构
  // AR模型2 心脏结构
  // 【数字特色： 三维模型】
  // 三维模型1 消化系统解剖结构
  // 三维模型2 泌尿系统解剖结构
  // 三维模型3 甲状腺解剖结构
  // 【数字创新：虚拟仿真数字人】
  // 数字人案例1 肝硬化案例
  // 数字人案例2 甲状腺功能亢进症案例
}
