export default {
  // 儿科学 2024年6月 第10版
  儿科学: {
    绪论: {
      儿科学的范围和任务: {},
      儿科学的特点: {},
      儿童年龄分期: {
        胎儿期: {},
        新生儿期: {},
        婴儿期: {},
        幼儿期: {},
        学龄前期: {},
        学龄期: {},
        青春期: {},
      },
      儿科学的发展与展望: {},
    },
    生长发育: {
      生长发育规律: {
        '生长发育呈现连续性、阶段性的特点': {},
        '各系统、器官生长发育速度不完全同步': {},
        生长发育的一般规律: {},
        生长发育的个体差异: {},
      },
      影响生长发育的因素: {
        遗传因素: {},
        环境因素: {},
      },
      体格生长: {
        体格生长常用指标: {},
        出生至青春前期的体格生长规律: {},
        青春期的体格生长规律: {},
        体格生长评价: {},
      },
      与体格生长有关的其他系统的发育: {
        骨骼: {},
        牙齿: {},
        生殖系统: {},
      },
      神经心理发育: {
        神经系统的发育: {},
        感知觉的发育: {},
        运动的发育: {},
        语言的发育: {},
        心理活动的发展: {},
      },
      儿童神经心理发育的评价: {
        筛查性评估: {},
        诊断性评估: {},
      },
      发育行为与心理异常: {
        儿童发育与行为的概念: {},
        儿童期常见的发育与行为问题: {},
        青春期常见的心理行为问题: {},
        其他: {},
      },
    },
    儿童保健: {
      各年龄期儿童的保健重点: {
        胎儿期及围产期: {},
        新生儿期: {},
        婴儿期: {},
        幼儿期: {},
        学龄前期: {},
        学龄期: {},
        青春期: {},
      },
      儿童保健的具体措施: {
        护理: {},
        营养: {},
        计划免疫: {},
        儿童心理卫生: {},
        定期健康检查: {},
        体格锻炼: {},
        意外事故预防: {},
      },
    },
    儿科疾病诊治原则: {
      儿科病史采集和体格检查: {
        病史采集和记录: {},
        体格检查: {},
      },
      儿科疾病治疗原则: {
        护理原则: {},
        饮食治疗原则: {},
        药物治疗原则: {},
        心理治疗原则: {},
        伦理学原则: {},
      },
      儿童液体平衡的特点和液体疗法: {
        儿童液体平衡的特点: {},
        '水、电解质代谢紊乱': {},
        液体疗法时常用补液溶液: {},
        液体疗法: {},
      },
    },
    营养和营养障碍疾病: {
      儿童营养基础: {
        营养素与膳食营养素参考摄入量: {},
        消化系统功能发育与儿童营养的关系: {},
      },
      婴儿喂养: {
        母乳喂养: {},
        部分母乳喂养: {},
        人工喂养: {},
        婴儿食物转换: {},
      },
      幼儿营养: {
        营养特点: {},
        膳食安排及进食技能培养: {},
      },
      学龄前儿童营养: {
        营养特点: {},
        膳食建议: {},
      },
      学龄儿童和青春期儿童营养: {
        营养特点: {},
        膳食安排与营养知识教育: {},
      },
      营养支持: {
        肠内营养: {},
        肠外营养: {},
        从肠外营养过渡到肠内营养: {},
      },
      儿童营养状况评价: {},
      '蛋白质-能量营养不良': {},
      儿童单纯性肥胖: {},
      维生素营养障碍: {
        维生素A缺乏症: {},
        营养性维生素D缺乏: {},
      },
      微量元素缺乏: {
        锌缺乏: {},
        碘缺乏: {},
      },
    },
    新生儿与新生儿疾病: {
      概述: {},
      正常足月儿和早产儿的特点与护理: {},
      胎儿宫内生长异常: {
        宫内发育迟缓和小于胎龄儿: {},
        大于胎龄儿: {},
      },
      新生儿窒息与复苏: {},
      新生儿缺氧缺血性脑病: {},
      新生儿颅内出血: {},
      新生儿胎粪吸入综合征: {},
      新生儿呼吸窘迫综合征: {},
      支气管肺发育不良: {},
      新生儿持续肺动脉高压: {},
      新生儿黄疸: {},
      新生儿溶血病: {},
      新生儿感染性疾病: {
        新生儿败血症: {},
        新生儿感染性肺炎: {},
        新生儿破伤风: {},
        新生儿巨细胞病毒感染: {},
        先天性弓形虫感染: {},
        新生儿衣原体感染: {},
        先天性梅毒: {},
      },
      新生儿坏死性小肠结肠炎: {},
      新生儿出血症: {},
      新生儿低血糖和高血糖: {
        新生儿低血糖: {},
        新生儿高血糖: {},
      },
      新生儿低钙血症: {},
      新生儿脐部疾病: {
        脐炎: {},
        脐疝: {},
        脐肉芽肿: {},
      },
      新生儿产伤性疾病: {
        头颅血肿: {},
        锁骨骨折: {},
        臂丛神经麻痹: {},
        面神经麻痹: {},
      },
      早产儿视网膜病: {},
    },
    免疫性疾病: {
      概述: {},
      原发性免疫缺陷病: {},
      继发性免疫缺陷病: {},
      '获得性免疫缺陷综合征（艾滋病）': {},
    },
    风湿性疾病: {
      概述: {},
      风湿热: {},
      幼年型特发性关节炎: {},
      过敏性紫癜: {},
      川崎病: {},
    },
    感染性疾病: {
      病毒感染: {
        麻疹: {},
        脊髓灰质炎: {},
        水痘: {},
        传染性单核细胞增多症: {},
        流行性腮腺炎: {},
        手足口病: {},
        流行性感冒: {},
      },
      细菌感染: {
        猩红热: {},
        流行性脑脊髓膜炎: {},
      },
      结核病: {
        概述: {},
        原发性肺结核: {},
        急性粟粒性肺结核: {},
        结核性脑膜炎: {},
        潜伏结核感染: {},
      },
      深部真菌病: {
        概述: {},
        假丝酵母菌病: {},
        隐球菌病: {},
        曲霉病: {},
      },
      寄生虫病: {
        蛔虫病: {},
        蛲虫病: {},
        钩虫病: {},
      },
    },
    消化系统疾病: {
      儿童消化系统解剖生理特点: {
        口腔: {},
        食管: {},
        胃: {},
        肠: {},
        肝: {},
        胰腺: {},
        肠道细菌及粪便: {},
      },
      儿童消化系统疾病的诊断方法: {
        胃肠影像学: {},
        消化道内镜检查: {},
        胃肠动力学检查: {},
        呼吸试验: {},
      },
      口炎: {
        鹅口疮: {},
        疱疹性口炎: {},
      },
      胃食管反流及反流性食管炎: {},
      胃炎和消化性溃疡: {
        胃炎: {},
        消化性溃疡: {},
      },
      炎症性肠病: {},
      腹泻病: {},
      婴儿胆汁淤积症: {},
      先天性肥厚性幽门狭窄: {},
      肠套叠: {},
      先天性巨结肠: {},
      急性阑尾炎: {},
    },
    呼吸系统疾病: {
      '儿童呼吸系统解剖、生理和免疫特点': {
        呼吸系统胚胎发育: {},
        解剖特点: {},
        生理特点: {},
        免疫特点: {},
      },
      儿童呼吸系统疾病检查方法: {
        呼吸系统体格检查时的重要体征: {},
        检查方法: {},
      },
      急性上呼吸道感染: {},
      急性感染性喉炎: {},
      急性支气管炎: {},
      毛细支气管炎: {},
      肺炎: {
        几种常见病原体所致肺炎的特点: {},
      },
      支气管哮喘: {},
      支气管扩张症: {},
    },
    心血管系统疾病: {
      儿童心血管系统解剖生理特点: {
        心脏的胚胎发育: {},
        '胎儿-新生儿循环转换': {},
      },
      儿童心血管系统疾病的诊断方法: {
        病史和体格检查: {},
        辅助检查: {},
      },
      先天性心脏病: {
        概述: {},
        房间隔缺损: {},
        室间隔缺损: {},
        动脉导管未闭: {},
        肺动脉瓣狭窄: {},
        法洛四联症: {},
        完全性大动脉转位: {},
      },
      病毒性心肌炎: {},
      心内膜弹力纤维增生症: {},
      感染性心内膜炎: {},
      儿童心律失常: {
        期前收缩: {},
        阵发性室上性心动过速: {},
        室性心动过速: {},
        房室传导阻滞: {},
      },
      心力衰竭: {},
    },
    泌尿系统疾病: {
      儿童泌尿系统解剖生理特点: {
        泌尿系统胚胎发育: {},
        解剖特点: {},
        生理特点: {},
      },
      儿童泌尿系统疾病的诊断方法: {},
      肾小球疾病: {
        儿童肾小球疾病的临床分类: {},
        急性肾小球肾炎: {},
        肾病综合征: {},
      },
      肾小管疾病: {
        肾小管性酸中毒: {},
        巴特综合征: {},
      },
      溶血尿毒症综合征: {},
      泌尿道感染: {},
      血尿: {},
      急性肾损伤: {},
    },
    血液系统疾病: {
      儿童造血和血象特点: {
        造血特点: {},
        血象特点: {},
      },
      儿童血液系统疾病的诊断方法: {
        血液系统疾病体格检查: {},
        血液系统疾病辅助检查: {},
      },
      儿童贫血概述: {},
      营养性贫血: {
        缺铁性贫血: {},
        营养性巨幼红细胞贫血: {},
      },
      溶血性贫血: {
        遗传性球形红细胞增多症: {},
        '红细胞葡萄糖-6-磷酸脱氢酶缺乏症': {},
        地中海贫血: {},
        自身免疫性溶血性贫血: {},
      },
      出血性疾病: {
        免疫性血小板减少症: {},
        血友病: {},
      },
      急性白血病: {},
      朗格汉斯细胞组织细胞增生症: {},
      噬血细胞性淋巴组织细胞增生症: {
        病因与发病机制: {},
        临床表现: {},
        实验室检查: {},
        诊断与鉴别诊断: {},
        治疗: {},
        疗效评估: {},
        预后: {},
      },
      神经肌肉系统疾病: {
        儿童神经系统解剖生理特点: {},
        儿童神经系统疾病的诊断方法: {
          神经系统体格检查: {},
          神经系统辅助检查: {},
        },
        惊厥: {},
        癫痫: {},
        急性细菌性脑膜炎: {},
        病毒性脑炎: {},
        脑性瘫痪: {},
        '吉兰-巴雷综合征': {},
        重症肌无力: {},
        进行性肌营养不良: {},
      },
      内分泌疾病: {
        概述: {},
        生长激素缺乏症: {},
        中枢性尿崩症: {},
        性早熟: {},
        先天性甲状腺功能减退症: {},
        先天性肾上腺皮质增生症: {},
        儿童糖尿病: {},
      },
      遗传性疾病: {
        概述: {
          遗传性疾病的分类: {},
          遗传性疾病的诊断: {},
          遗传性疾病的治疗: {},
          遗传咨询: {},
          遗传疾病的预防: {},
          新生儿筛查: {},
        },
        染色体疾病: {
          '21-三体综合征': {},
          先天性卵巢发育不良综合征: {},
          DiGeorge综合征: {},
        },
        单基因遗传疾病: {
          遗传代谢病概述: {},
          苯丙酮尿症: {},
          肝豆状核变性: {},
          糖原贮积症: {},
          黏多糖贮积症: {},
          甲基丙二酸血症: {},
          '其他单基因疾病—CHARGE综合征': {},
        },
        基因组印记相关疾病: {},
      },
      儿童常见危重症: {
        概述: {},
        急性呼吸衰竭: {},
        脓毒症及脓毒性休克: {},
        急性中毒: {},
        意外伤害: {
          创伤: {},
          溺水: {},
          毒蛇咬伤: {},
        },
        儿童心肺复苏: {},
      },
      // 附录
      // 附录一 2015年中国九市儿童体格发育测量值
      // 附表1-1 2015年九市3岁以下儿童体格发育测量值（x±s）
      // 附表1-2 2015年九市3～＜7岁儿童体格发育测量值（x±s）
      // 附录二 中国居民膳食指南（2022）
      // 附录三 脑脊液测定参考区间
      // 附录四 血液一般检测参考区间
      // 附录五 心电图各波的正常值
      // 推荐阅读
      // 中英文名词对照索引
      // 【数字创新：虚拟仿真数字人】
      // 数字人案例1
      // 数字人案例2
    },
  },
}
