export const useBookStore = defineStore('book', () => {
  const books = ref({
    // 外科学 2024年7月 第10版
    // 第一篇 外科学基础
    外科学: {
      绪论: {
        中医外科学发展简史: {},
        工业革命与现代外科学发展: {},
        外科疾病分类与外科专业分科: {},
        怎样学习外科学: {},
        外科规范: {},
      },
      外科无菌原则: {
        '手术器械、物品的灭菌、消毒法': {},
        手术人员和病人手术区域的准备: {},
        手术进行中的无菌原则: {},
        手术室的管理: {},
      },
      '水、电解质代谢紊乱和酸碱平衡失调': {
        概述: {},
        '水、钠代谢紊乱': {
          脱水: {},
          水中毒和水肿: {},
        },
        钾代谢紊乱: {
          低钾血症: {},
          高钾血症: {},
        },
        '镁、钙、磷代谢紊乱': {
          镁代谢紊乱: {},
          '钙、磷代谢紊乱': {},
        },
        酸碱平衡失调: {
          代谢性酸中毒: {},
          代谢性碱中毒: {},
          呼吸性酸中毒: {},
          呼吸性碱中毒: {},
        },
      },
      输血: {
        输血的适应症和注意事项: {},
        输血的不良反应及其防治: {},
        自体输血和大量输血: {},
        血液成分制品: {},
        血液代用品和造血生物工程制品: {},
      },
      休克: {
        概述: {},
        低血容量性休克: {
          失血性休克: {},
          创伤性休克: {},
        },
        感染性休克: {},
      },
      外科病人的代谢与营养治疗: {
        外科病人的代谢变化: {},
        '营养评价、营养风险筛查及营养不良诊断': {},
        肠外营养: {},
        肠内营养: {},
      },
      肥胖与代谢性疾病: {
        概述: {},
        肥胖与代谢病的外科治疗: {},
      },
      外科感染: {
        概述: {},
        浅部组织细菌性感染: {
          疖与痈: {},
          急性蜂窝织炎: {},
          丹毒: {},
          急性淋巴管炎和淋巴结炎: {},
        },
        '手、足部急性化脓性细菌感染': {},
        切口感染: {},
        脓毒症: {},
        有芽孢厌氧菌感染: {
          破伤风: {},
          气性坏疽: {},
        },
        外科应用抗菌药物的原则: {},
      },
      创伤: {
        概述: {},
        创伤病理生理: {},
        创伤的初步评估与管理: {},
        治疗原则: {},
      },
      '烧伤、冻伤、蛇咬伤、犬咬伤、虫蜇伤': {
        热力烧伤: {
          伤情判断: {},
          烧伤病理生理和临床分期: {},
          治疗原则: {},
          '现场急救、转运和初期处理': {},
          烧伤休克: {},
          烧伤全身性感染: {},
          常见内脏并发症的防治: {},
          创面处理: {},
          烧伤的预防: {},
          皮肤移植术: {},
        },
        电烧伤和化学烧伤: {
          电烧伤: {},
          化学烧伤: {},
        },
        冻伤: {
          非冻结性冻伤: {},
          冻结性冻伤: {},
        },
        蛇咬伤: {},
        犬咬伤: {},
        虫蛰伤: {},
      },
      肿瘤: {
        概述: {
          肿瘤的诊断: {},
          实体肿瘤的常用治疗方法: {},
          肿瘤的预防及随访: {},
        },
        常见体表肿瘤与囊肿: {
          皮肤乳头状瘤: {},
          皮肤癌: {},
          痣与黑色素瘤: {},
          脂肪瘤: {},
          纤维瘤及纤维瘤样病变: {},
          神经纤维瘤: {},
          血管瘤: {},
          囊性肿瘤及囊肿: {},
        },
      },
      '器官、组织和细胞移植': {
        概述: {
          移植的概念与分类: {},
          临床移植简史: {},
        },
        移植免疫: {
          移植抗原: {},
          移植抗原的识别与免疫应答: {},
          临床排斥反应的机制和分类: {},
          排斥反应的防治: {},
          移植免疫耐受: {},
        },
        移植器官的获取: {
          供体的选择: {},
          器官的切取与保存: {},
        },
        器官移植: {
          肾移植: {},
          肝移植: {},
          胰腺移植: {},
          小肠移植: {},
          肺移植: {},
          心脏移植: {},
        },
        组织及细胞移植: {
          组织移植: {},
          细胞移植: {},
        },
      },
      显微外科技术: {
        显微外科的设备和器材: {},
        显微外科基本手术技术: {},
        显微外科的应用范围: {},
        显微外科技术新进展: {},
      },
      外科微创技术: {
        概述: {},
        内镜技术: {
          内镜技术的发展史: {},
          内镜的基本原理和种类: {},
          内镜下常用的诊断技术及治疗器械: {},
          内镜技术在外科中的应用: {},
          经自然腔道内镜手术简介: {},
        },
        腔镜外科技术: {
          概述: {},
          '腹腔镜外科手术设备、器械与基本技术': {},
          腹腔镜外科手术适应证及常用的手术: {},
          腹腔镜手术的并发症: {},
          机器人辅助外科技术: {},
        },
        介入放射学技术: {},
      },
      // 第二篇 麻醉与围手术期处理
      麻醉: {
        概述: {},
        麻醉前评估和准备: {
          麻醉前评估: {},
          麻醉前准备: {},
        },
        全身麻醉: {
          全身麻醉药: {},
          全身麻醉的实施: {},
          呼吸道的管理: {},
          全身麻醉的并发症及其防治: {},
        },
        局部麻醉: {
          局部麻醉药: {},
          局部麻醉的方法: {},
          局部麻醉的并发症及其防治: {},
        },
        椎管内麻醉: {
          椎管内麻醉的解剖基础: {},
          椎管内麻醉的机制及生理: {},
          椎管内麻醉的方法: {},
          椎管内麻醉的并发症及其防治: {},
        },
        麻醉期间和麻醉恢复期的监测和管理: {
          麻醉期间的监测和管理: {},
          麻醉恢复期的监测和管理: {},
        },
      },
      疼痛治疗: {
        概述: {},
        疼痛的病理生理学: {},
        急性疼痛的治疗和管理: {
          术后镇痛的原则和方法: {},
          术后镇痛并发症及预防: {},
        },
        慢性疼痛的诊断和治疗: {
          慢性疼痛的诊治范围: {},
          慢性疼痛治疗常用方法: {},
          癌痛治疗: {},
          疼痛综合管理: {},
        },
      },
      重症监测治疗与复苏: {
        重症监测治疗: {
          概述: {},
          重症监测治疗的主要内容: {},
          病情评估: {},
          重症监测治疗的人文关怀: {},
        },
        心肺脑复苏: {
          初步复苏: {},
          加强复苏: {},
          复苏后治疗: {},
        },
        急性肾损伤: {},
        急性呼吸窘迫综合征: {},
      },
      围手术期处理: {
        术前准备: {},
        术后处理: {},
        术后并发症的防治: {},
      },
      // 第三篇 神经外科疾病
      颅内压增高和脑疝: {
        概述: {},
        颅内压增高: {},
        脑疝: {},
      },
      颅脑损伤: {
        概述: {},
        头皮损伤: {
          头皮血肿: {},
          头皮裂伤: {},
          头皮撕脱伤: {},
        },
        颅骨骨折: {
          颅盖骨折: {},
          颅底骨折: {},
        },
        脑损伤: {
          脑震荡: {},
          脑挫裂伤: {},
          弥漫性轴索损伤: {},
        },
        颅内血肿: {
          硬脑膜外血肿: {},
          硬脑膜下血肿: {},
          脑内血肿: {},
        },
        开放性颅脑损伤: {
          非火器性开放性颅脑损伤: {},
          火器性颅脑损伤: {},
        },
        颅脑损伤并发症及其处理: {
          外伤性脑脊液漏: {},
          脑外伤后脑积水: {},
          颅骨缺损: {},
          外伤性癫痫: {},
          脑创伤后综合征: {},
          外伤后下丘脑损伤: {},
          颅脑损伤后精神障碍: {},
        },
      },
      颅内和椎管内肿瘤: {
        颅内肿瘤: {
          概述: {},
          弥漫性胶质瘤: {},
          脑膜瘤: {},
          垂体膜瘤: {},
          神经纤维瘤: {},
          髓母细胞瘤: {},
          生殖细胞肿瘤: {},
          颅内转移瘤: {},
          其他颅内肿瘤: {},
        },
        椎管内肿瘤: {
          概述: {},
          神经鞘瘤: {},
          脊膜瘤: {},
          髓内肿瘤: {},
          椎管转移瘤: {},
          先天性脊髓肿瘤: {},
        },
      },
      颅内和椎管内血管性疾病: {
        自发性蛛网膜下腔出血: {},
        颅内动脉瘤: {},
        颅内和椎管内血管畸形: {
          动静脉畸形: {},
          海绵状血管畸形: {},
        },
        脑底异常血管网症: {},
        硬脑膜动静脉瘘: {},
        脑血管疾病复合手术: {},
        缺血性脑卒中外科治疗: {},
        脑出血外科治疗: {},
      },
      颅脑和脊髓先天性畸形: {
        概述: {},
        先天性脑积水: {},
        颅裂和脊柱裂: {
          颅裂: {},
          脊柱裂: {},
        },
        狭颅症: {},
        颅底陷入症: {},
        脊髓栓系综合征: {},
      },
      功能神经疾病: {
        癫痫: {},
        帕金森病: {},
        原发性震颤: {},
        神经血管压迫综合征: {},
        脑机接口与脑功能修复: {},
      },
      // 第四篇 颈部与乳腺外科疾病
      颈部疾病: {
        甲状腺疾病: {
          解剖生理概要: {},
          单纯性甲状腺肿: {},
          甲状腺功能亢进的外科治疗: {},
          甲状腺炎: {},
          甲状腺腺瘤: {},
          甲状腺癌: {},
          甲状腺结节的诊断和处理原则: {},
        },
        甲状旁腺功能亢进的外科治疗: {
          原发性甲状旁腺功能亢进: {},
          继发性甲状旁腺功能亢进: {},
        },
        颈淋巴结结核: {},
        颈部肿块: {
          概述: {},
          常见的颈部肿块: {},
        },
      },
      乳房疾病: {
        解剖生理概要: {},
        乳房检查: {},
        乳腺良性疾病: {
          乳腺囊性增生病: {},
          纤维腺瘤: {},
          导管内乳头状瘤: {},
          乳腺炎: {},
        },
        乳腺癌: {},
        乳腺非上皮源性肿瘤: {
          乳腺叶状肿瘤: {},
          乳腺肉瘤: {},
          乳腺恶性淋巴瘤: {},
        },
      },
      // 第五篇 胸部外科疾病
      胸部损伤: {
        概述: {},
        肋骨骨折: {},
        气胸: {
          闭合性气胸: {},
          开放性气胸: {},
          张力性气胸: {},
        },
        血胸: {},
        创伤性窒息: {},
        肺损伤: {},
        心脏损伤: {
          钝性心脏损伤: {},
          穿透性心脏损伤: {},
        },
        膈肌损伤: {
          穿透性膈肌损伤: {},
          钝性膈肌损伤: {},
        },
      },
      '胸壁、胸膜疾病': {
        先天性胸壁畸形: {
          漏斗胸: {},
          鸡胸: {},
        },
        脓胸: {
          急性脓胸: {},
          慢性脓胸: {},
        },
        胸壁结核: {},
        '胸壁、胸膜肿瘤': {
          胸壁肿瘤: {},
          胸膜肿瘤: {},
        },
      },
      肺疾病: {
        肺大疱: {},
        肺感染性疾病的外科治疗: {
          支气管扩张的外科治疗: {},
          肺结核的外科治疗: {},
          肺棘球蚴病的外科治疗: {},
          侵袭性肺真菌感染的外科治疗: {},
        },
        肺肿瘤: {
          肺癌: {},
          肺转移性肿瘤: {},
          肺良性肿瘤: {},
        },
        气管肿瘤: {},
      },
      食管疾病: {
        食管癌: {},
        食管良性肿瘤: {},
        腐蚀性食管灼伤: {},
        贲门失弛缓症: {},
        食管憩室: {
          咽食管憩室: {},
          食管中段憩室: {},
          隔上憩室: {},
        },
      },
      原发性纵隔疾病: {
        原发性纵隔肿瘤: {
          概述: {},
          胸腺肿瘤: {},
          神经源性肿瘤: {},
          畸胎瘤与皮样囊肿: {},
          其他肿瘤: {},
        },
        纵隔感染: {},
      },
      // 第六篇 心脏与血管外科疾病
      心脏疾病: {
        心内直视手术基础措施: {
          体外循环: {},
          心肌保护: {},
        },
        先天性心脏病的外科治疗: {
          动脉导管未闭: {},
          肺动脉口狭窄: {},
          房间隔缺损: {},
          室间隔缺损: {},
          主动脉缩窄: {},
          主动脉窦瘤: {},
          法洛四联症: {},
        },
        后天性心脏病的外科治疗: {
          冠状动脉粥样硬化性心脏病: {},
          二尖瓣狭窄: {},
          二尖瓣关闭不全: {},
          主动脉瓣狭窄: {},
          主动脉瓣关闭不全: {},
          心脏黏液瘤: {},
          慢性缩窄性心包炎: {},
        },
      },
      主动脉疾病: {
        主动脉瘤: {},
        主动脉夹层: {},
        多发性大动脉炎: {},
      },
      周围血管与淋巴疾病: {
        概述: {},
        周围血管损伤: {},
        动脉疾病: {
          动脉硬化性闭塞症: {},
          血栓闭塞性脉管炎: {},
          动脉栓塞: {},
          雷诺综合征: {},
          周围动脉瘤: {},
          内脏动脉瘤: {},
        },
        静脉疾病: {
          解剖结构与血流动力学: {},
          下肢慢性静脉功能不全: {},
          深静脉血栓形成: {},
        },
        动静脉瘘: {
          先天性动静脉瘘: {},
          损伤性动静脉瘘: {},
        },
        淋巴水肿: {},
      },
      // 第七篇 腹部外科疾病
      腹外疝: {
        概述: {},
        腹股沟疝: {},
        股疝: {},
        其他腹外疝: {},
      },
      腹部损伤: {
        概述: {},
        常见内脏损伤的特征和处理: {
          脾损伤: {},
          肝损伤: {},
          胰腺损伤: {},
          胃和十二指肠损伤: {},
          小肠损伤: {},
          结肠损伤: {},
          直肠损伤: {},
          腹膜后血肿: {},
        },
      },
      急性化脓性腹膜炎: {
        急性弥漫性腹膜炎: {},
        腹腔脓肿: {
          隔下脓肿: {},
          盆腔脓肿: {},
          肠间脓肿: {},
        },
        腹腔间室综合征: {},
      },
      胃十二指肠疾病: {
        解剖生理概要: {},
        胃癌及其他胃肿瘤: {
          胃癌: {},
          胃淋巴瘤: {},
          胃肠道间质瘤: {},
          胃的良性肿瘤: {},
        },
        胃十二指肠溃疡的外科治疗: {
          概述: {},
          胃十二指肠溃疡穿孔: {},
          胃十二指肠溃疡大出血: {},
          胃十二指肠溃疡瘢痕性幽门梗阻: {},
          胃大部切除术与注意事项: {},
          术后并发症: {},
        },
        胃食管反流病: {},
        先天性肥厚性幽门狭窄: {},
        十二指肠憩室: {},
        十二指肠瘀滞症: {},
      },
      小肠疾病: {
        解剖生理概要: {},
        肠感染性疾病: {
          肠结核: {},
          肠伤寒穿孔: {},
        },
        非感染性肠疾病: {
          急性出血性肠炎: {},
          克罗恩病: {},
        },
        肠梗阻: {
          粘连性肠梗阻: {},
          肠扭转: {},
          肠套叠: {},
        },
        肠系膜血管缺血性疾病: {},
        短肠综合征: {},
        小肠肿瘤: {},
        先天性肠疾病: {
          先天性肠闭锁和肠狭窄: {},
          先天性肠旋转不良: {},
        },
      },
      阑尾疾病: {
        解剖生理概要: {},
        急性阑尾炎: {},
        特殊类型阑尾炎: {},
        慢性阑尾炎: {},
        阑尾肿瘤: {},
      },
      '结、直肠与肛管疾病': {
        解剖生理概要: {},
        '结、直肠及肛管检查方法': {},
        乙状结肠扭转: {},
        溃疡性结肠炎的外科治疗: {},
        肠息肉及肠息肉病: {
          肠息肉: {},
          肠息肉病: {},
        },
        结肠癌: {},
        直肠癌: {},
        肛门直肠先天性疾病: {
          先天性肛门直肠畸形: {},
          先天性巨结肠: {},
        },
        肛裂: {},
        肛周脓肿: {},
        肛瘘: {},
        痔: {},
        直肠脱垂: {},
        便秘的外科治疗: {},
      },
      肝疾病: {
        解剖生理概要: {},
        肝脓肿: {
          细菌性肝脓肿: {},
          阿米巴肝脓肿: {},
        },
        肝棘球蚴病: {},
        原发性肝恶性肿瘤: {
          肝细胞癌: {},
          肝内胆管癌: {},
        },
        转移性肝肿瘤: {},
        肝良性肿瘤: {},
        肝囊肿: {},
      },
      门静脉高压症: {
        // 巴德-吉亚利综合征: {},
      },
      胆道疾病: {
        解剖生理概要: {
          胆道系统的应用解剖: {},
          胆道系统的生理功能: {},
        },
        影像学检查: {},
        胆道畸形: {
          胆道闭锁: {},
          先天性胆管扩张症: {},
        },
        胆石症: {
          概述: {},
          胆囊结石: {},
          肝外胆管结石: {},
          肝内胆管结石: {},
        },
        胆道感染: {
          急性胆囊炎: {},
          慢性胆囊炎: {},
          急性梗阻性化脓性胆管炎: {},
        },
        原发性硬化性胆管炎: {},
        胆道蛔虫病: {},
        胆道疾病常见并发症: {
          胆囊穿孔: {},
          胆道出血: {},
          胆管炎性狭窄: {},
          胆源性肝脓肿: {},
          胆源性急性胰腺炎: {},
        },
        胆管损伤: {},
        胆囊息肉和良性肿瘤: {
          胆囊息肉: {},
          胆囊腺瘤: {},
        },
        胆道恶性肿瘤: {
          胆囊癌: {},
          胆管癌: {},
        },
      },
      胰腺疾病: {
        解剖生理概要: {},
        胰腺炎: {
          急性胰腺炎: {},
          慢性胰腺炎: {},
        },
        胰腺囊性疾病: {
          胰腺假性囊肿: {},
          胰腺囊性肿瘤: {},
        },
        胰腺癌和壶腹周围癌: {
          胰腺癌: {},
          壶腹周围癌: {},
        },
        胰腺神经内分泌肿瘤: {
          胰岛素瘤: {},
          胃泌素瘤: {},
        },
      },
      脾疾病: {
        常见脾疾病: {},
        常见脾疾病的治疗方法: {},
      },
      消化道大出血的诊断与外科处理原则: {
        上消化道大出血的诊断和处理: {},
        下消化道大出血的诊断和处理: {},
      },
      急腹症的诊断与鉴别诊断: {},
      // 第八篇 泌尿外科疾病
      '泌尿、男生殖系统疾病总论': {
        '泌尿、男生殖系统外科解剖生理概要': {},
        泌尿系统梗阻的病理生理学概要: {},
        '泌尿、男生殖系统外科疾病的症状学': {},
        '泌尿、男生殖系统专科检查': {
          实验室检查: {},
          影像学检查: {},
          专科器械检查: {},
        },
      },
      '泌尿、男生殖系统先天性畸形': {
        概述: {},
        肾和输尿管先天性畸形: {
          多囊肾: {},
          马蹄形肾: {},
          '重复肾盂、输尿管': {},
          肾盂输尿管连接处梗阻: {},
          输尿管膀胱连接处梗阻: {},
        },
        膀胱和尿道先天性畸形: {
          膀胱外翻: {},
          尿道上裂: {},
          尿道下裂: {},
        },
        男性生殖器官先天性畸形: {
          隐睾症: {},
          隐匿性阴茎: {},
        },
      },
      '泌尿、男生殖系统损伤': {
        概述: {},
        肾损伤: {},
        输尿管损伤: {},
        膀胱损伤: {},
        尿道损伤: {
          前尿道损伤: {},
          后尿道损伤: {},
        },
        阴茎损伤: {},
        睾丸损伤: {},
      },
      '泌尿、男生殖系统感染': {
        概述: {},
        上尿路感染: {
          急性肾盂肾炎: {},
          肾积脓: {},
          肾皮质脓肿及肾周围炎: {},
        },
        下尿路感染: {
          急性细菌性膀胱炎: {},
          慢性细菌性膀胱炎: {},
          尿道炎: {},
        },
        男生殖系统感染: {
          急性细菌性前列腺炎: {},
          慢性前列腺炎: {},
          急性附睾炎: {},
          慢性附睾炎: {},
        },
        '泌尿、男生殖系统结核': {
          泌尿系统结核: {},
          男生殖系统结核: {},
        },
      },
      良性前列腺增生: {
        概述: {},
        良性前列腺增生的诊断: {},
        良性前列腺增生的治疗: {},
        亮相前列腺增生的随访: {},
      },
      泌尿系统结石: {
        概述: {},
        上尿路结石: {},
        下尿路结石: {},
      },
      '泌尿、男生殖系统肿瘤': {
        肾肿瘤: {
          肾细胞癌: {},
          肾母细胞瘤: {},
          肾血管平滑肌脂肪瘤: {},
        },
        尿路上皮肿瘤: {
          膀胱肿瘤: {},
          '肾盂癌、输尿管癌': {},
        },
        前列腺癌: {},
        阴茎癌: {},
        睾丸肿瘤: {},
      },
      肾上腺外科疾病: {
        概述: {},
        原发性醛固酮增多症: {},
        皮质醇增多症: {},
        儿茶酚胺增多症: {
          肾上腺嗜铬细胞瘤: {},
          肾上腺髓质增生: {},
        },
        无功能肾上腺肿物: {},
      },
      男性性功能障碍与不育: {
        概述: {},
        男性性功能障碍: {
          勃起功能障碍: {},
          早泄: {},
        },
        男性不育症: {},
      },
      '泌尿、男生殖系统的其他疾病': {
        肾血管性高血压: {},
        神经源性膀胱: {},
        尿道狭窄: {},
        女性压力性尿失禁: {},
        包茎和包皮过长: {},
        阴囊内疾病: {
          精索静脉曲张: {},
          精索及睾丸鞘膜积液: {},
          睾丸扭转: {},
        },
      },
      // 第九篇 骨科疾病
      运动系统畸形: {
        先天性畸形: {
          先天性肌性斜颈: {},
          先天性手部畸形: {},
          发育型髋关节脱位: {},
          先天性马蹄内翻足: {},
        },
        姿态性畸形: {
          平足症: {},
          𧿹外翻: {},
          脊柱侧凸: {},
        },
      },
      骨折概述: {
        '骨折的定义、成因、分类及移位': {},
        骨折的临床表现及影像学检查: {},
        骨折的并发症: {},
        骨折愈合过程: {},
        影响骨折愈合的因素: {},
        骨折的急救: {},
        骨折的治疗原则: {
          骨折的复位: {},
          骨折的固定: {},
          康复治疗: {},
        },
        开放性骨折的处理: {},
        开放性关节损伤处理原则: {},
        '骨折延迟愈合、不愈合和畸形愈合的处理': {},
      },
      '上肢骨、关节损伤': {
        锁骨骨折: {},
        肩锁关节脱位: {},
        肩关节脱位: {},
        肱骨近端骨折: {},
        肱骨干骨折: {},
        肱骨髁上骨折: {
          伸直型肱骨髁上骨折: {},
          屈曲型肱骨髁上骨折: {},
        },
        肘关节脱位: {},
        桡骨头半脱位: {},
        前臂双骨折: {},
        桡骨远端骨折: {
          伸直型骨折: {},
          屈曲型骨折: {},
          桡骨远端关节面骨折伴腕关节脱位: {},
        },
      },
      '手外伤及断肢（指）再植': {
        手外伤: {},
        '断肢（指）再植': {},
      },
      '下肢骨、关节损伤': {
        髋关节脱位: {
          髋关节后脱位: {},
          髋关节前脱位: {},
          髋关节中心脱位: {},
        },
        股骨近端骨折: {
          股骨颈骨折: {},
          股骨转子间骨折: {},
        },
        股骨干骨折: {},
        股骨远端骨折: {},
        髌骨骨折: {},
        膝关节韧带损伤: {},
        膝关节半月板损伤: {},
        胫骨平台骨折: {},
        胫腓骨骨干骨折: {},
        踝部骨折: {},
        踝部扭伤: {
          // 跟腱断裂: {},
        },
        足部骨折: {
          跟骨骨折: {},
          跖骨骨折: {},
          趾骨骨折: {},
        },
      },
      '脊柱、脊髓损伤': {
        脊柱骨折: {},
        脊髓损伤: {},
      },
      '骨盆、髋臼骨折': {
        骨盆骨折: {},
        髋臼骨折: {},
      },
      周围神经损伤: {
        概述: {},
        上肢神经损伤: {},
        下肢神经损伤: {},
        周围神经卡压综合征: {
          腕管综合征: {},
          肘管综合征: {},
          旋后肌综合征: {},
          梨状肌综合征: {},
        },
      },
      运动系统慢性损伤: {
        概述: {},
        慢性软组织损伤: {
          腰腿痛: {},
          颈肩痛: {},
          '棘上、棘间韧带损伤': {},
        },
        骨的慢性损伤: {
          疲劳骨折: {},
          月骨缺血性坏死: {},
        },
        软骨慢性损伤: {
          髌骨软骨软化症: {},
          胫骨结节骨软骨病: {},
          股骨头骨软骨病: {},
        },
        与慢性损伤相关的其他疾病: {
          滑囊炎: {},
          狭窄性腱鞘炎: {},
          腱鞘囊肿: {},
          肱骨外上髁炎: {},
          粘连性肩关节囊炎: {},
        },
      },
      股骨头坏死: {},
      '颈、腰椎退行性疾病': {
        颈椎退行性疾病: {
          颈椎病: {},
          颈椎间盘突出症: {},
          颈椎后纵韧带骨化症: {},
        },
        腰椎退行性疾病: {
          腰椎间盘突出症: {},
          腰椎管狭窄症: {},
          腰椎滑脱症: {},
        },
      },
      骨与关节化脓性感染: {
        化脓性骨髓炎: {
          急性化脓性骨髓炎: {},
          慢性化脓性骨髓炎: {},
          局限性骨脓肿: {},
          硬化性骨髓炎: {},
          化脓性脊柱炎: {},
        },
        化脓性关节炎: {},
      },
      骨与关节结核: {
        概述: {},
        脊柱结核: {},
        髋关节结核: {},
        膝关节结核: {},
      },
      化脓性关节炎: {
        骨关节炎: {},
        强制性脊柱炎: {},
        类风湿关节炎: {},
      },
      骨肿瘤: {
        概述: {},
        良性骨肿瘤: {
          骨样骨瘤: {},
          骨软骨瘤: {},
          软骨瘤: {},
        },
        骨巨细胞瘤: {},
        原发性恶性骨肿瘤: {
          骨肉瘤: {},
          软骨肉瘤: {},
          骨纤维肉瘤: {},
          尤因肉瘤: {},
          恶性淋巴瘤: {},
          骨髓瘤: {},
          脊索瘤: {},
        },
        转移性骨肿瘤: {},
        骨囊肿和其他良性疾病: {
          骨囊肿: {},
          动脉瘤性骨囊肿: {},
          骨嗜酸性肉芽肿: {},
          骨纤维发育不良: {},
          滑膜性软骨化生: {},
          色素沉着绒毛结节性滑膜炎: {},
        },
      },
    },
    内科学: {},
    妇科学: {},
    儿科学: {},
    神经病学: {},
  })

  return { books }
})
