export default {
  // 神经病学 2024年7月 第9版
  神经病学: {
    绪论: {
      神经病学的概念和范畴: {},
      神经病学的特性及医学生的学习目标: {},
      神经病学的历史发展与未来展望: {},
    },

    神经系统解剖生理及定位诊断: {
      中枢神经: {
        大脑半球: {},
        内囊: {},
        基底神经节: {},
        间脑: {},
        脑干: {},
        小脑: {},
        脊髓: {},
      },
      脑与脊髓的血管: {
        脑的血管: {},
        脊髓的血管: {},
      },
      脑神经: {
        嗅神经: {},
        视神经: {},
        '动眼、滑车和展神经': {},
        三叉神经: {},
        面神经: {},
        前庭蜗神经: {},
        '舌咽、迷走神经': {},
        副神经: {},
        舌下神经: {},
      },
      周围神经: {
        脊神经: {},
        自主神经: {},
        周围神经损伤的病理类型: {},
      },
      肌肉: {},
      运动系统: {},
      感觉系统: {},
      反射: {},
    },
    神经系统疾病的常见症状和体征: {
      意识障碍: {
        以觉醒度改变为主的意识障碍: {},
        以意识内容改变为主的意识障碍: {},
        特殊类型的意识障碍: {},
        意识障碍的鉴别诊断: {},
        伴发不同症状和体征的意识障碍病因诊断: {},
      },
      认知障碍: {
        记忆障碍: {},
        视空间障碍: {},
        执行功能障碍: {},
        计算力障碍: {},
        失语: {},
        失用: {},
        失认: {},
        轻度认知障碍和痴呆: {},
      },
      头痛: {},
      癫痫发作和晕厥: {
        癫痫发作: {},
        晕厥: {},
        癫痫发作与晕厥的鉴别: {},
      },
      眩晕: {},
      视觉障碍: {},
      听觉障碍: {},
      眼球震颤: {},
      构音障碍: {},
      瘫痪: {},
      肌萎缩: {},
      躯体感觉障碍: {},
      共济失调: {},
      步态异常: {},
      不自主运动: {},
      尿便障碍: {
        排尿障碍: {},
        排便障碍: {},
      },
      颅内压异常和脑疝: {
        颅内压异常: {},
        脑疝: {},
      },
      睡眠障碍: {},
    },
    神经系统疾病的病史采集和体格检查: {
      病史采集: {
        主诉: {},
        现病史: {},
        既往史: {},
        个人史: {},
        家族史: {},
        病史采集的注意事项和技巧: {},
      },
      体格检查: {
        一般检查: {},
        意识状态的检查: {},
        精神状态和高级皮质功能检查: {},
        脑神经检查: {},
        运动系统检查: {},
        感觉系统检查: {},
        反射检查: {},
        脑膜刺激征检查: {},
        自主神经检查: {},
      },
    },
    神经系统疾病的辅助检查: {
      腰椎穿刺和脑脊液检查: {
        腰椎穿刺: {},
        脑脊液检查: {},
      },
      神经系统影像学检查: {
        头颅和脊柱X线: {},
        数字减影血管造影: {},
        电子计算机断层扫描: {},
        磁共振成像: {},
        经颅多普勒超声: {},
        颈动脉彩色多普勒超声: {},
      },
      神经电生理检查: {
        脑电图: {},
        脑磁图: {},
        诱发电位: {},
        肌电图和神经传导速度测定: {},
      },
      放射性核素检查: {
        单光子发射计算机断层扫描: {},
        正电子发射断层扫描: {},
      },
      神经系统疾病的病理组织学检查: {
        脑活组织检查: {},
        神经活组织检查: {},
        肌肉活组织检查: {},
        皮肤活组织检查: {},
      },
      基因诊断技术: {},
    },
    神经心理学检查: {
      认知功能评定: {},
      精神行为量表: {},
      其他: {},
    },
    神经系统疾病的诊断原则: {
      诊断程序: {
        定位诊断: {},
        定性诊断: {},
      },
      临床思维方法: {},
    },
    头痛: {
      偏头痛: {},
      紧张型头痛: {},
      丛集性头痛: {},
      药物过度使用性头痛: {},
      低颅压性头痛: {},
    },
    脑血管疾病: {
      脑血管疾病的分类: {},
      脑血管疾病危险因素及其预防: {},
      短暂性脑缺血发作: {},
      脑梗死: {
        大动脉粥样硬化性脑梗死: {},
        心源性脑栓塞: {},
        小动脉闭塞性脑梗死: {},
      },
      脑出血: {},
      蛛网膜下腔出血: {},
      其他动脉性疾病: {
        烟雾病: {},
        脑动脉盗血综合征: {},
        颅颈动脉夹层: {},
        脑淀粉样血管病: {},
      },
      脑静脉血栓形成: {},
      遗传性脑血管病: {
        伴皮质下梗死和白质脑病的常染色体显性遗传性脑动脉病: {},
        伴皮质下梗死和白质脑病的常染色体隐性遗传性脑动脉病: {},
        Fabry病: {},
      },
    },
    脑血管病的介入诊疗: {
      脑血管病的介入诊断: {
        全脑血管造影术: {},
        主动脉弓及弓上分支动脉: {},
        前循环系统: {},
        后循环系统: {},
        侧支循环: {},
        颅内外静脉系统: {},
      },
      脑血管病介入治疗术前评估及围手术期用药: {
        术前评估: {},
        围手术期用药: {},
      },
      缺血性脑血管病的介入治疗: {
        急性脑梗死的介入治疗: {},
        颅外动脉狭窄的介入治疗: {},
        颅内动脉狭窄的介入治疗: {},
      },
      出血性脑血管病的介入治疗: {
        颅内动脉瘤的介入治疗: {},
        脑血管畸形的介入治疗: {},
      },
      静脉性脑血管病的介入治疗: {},
      脑血管病介入诊疗并发症及其处理: {
        围手术期并发症及其防治措施: {},
        远期再狭窄及其防治策略: {},
      },
    },
    认知障碍性疾病: {
      阿尔茨海默病: {},
      路易体痴呆: {},
      额颞叶变性: {},
      血管性认知障碍: {},
    },
    运动神经元病: {
      肌萎缩侧索硬化: {},
      其他运动神经元病: {
        进行性肌萎缩: {},
        进行性延髓麻痹: {},
        原发性侧索硬化: {},
        特殊类型的运动神经元病: {},
      },
    },
    中枢神经系统感染性疾病: {
      病毒感染性疾病: {
        单纯疱疹病毒性脑炎: {},
        病毒性脑膜炎: {},
        其他病毒感染性脑炎或脑病: {},
      },
      细菌感染性疾病: {
        化脓性脑膜炎: {},
        结核性脑膜炎: {},
        神经型布鲁菌病: {},
      },
      新型隐球菌性脑膜炎: {},
      朊蛋白病: {
        '克-雅病': {},
        '吉斯特曼-施特劳斯综合征': {},
        致死性家族型失眠症: {},
      },
      螺旋体感染性疾病: {
        神经梅毒: {},
        其他螺旋体感染: {},
      },
      脑寄生虫病: {
        脑囊虫病: {},
        其他脑寄生虫感染: {},
      },
      艾滋病所致神经系统障碍: {},
    },
    自身免疫性脑炎: {
      '抗N-甲基-D-天冬氨酸受体脑炎': {},
      抗富亮氨酸胶质瘤失活蛋白1抗体相关脑炎: {},
      其他自身免疫性脑炎: {
        抗GABABR抗体相关脑炎: {},
        抗CASPR2抗体相关脑炎: {},
      },
    },
    中枢神经系统脱髓鞘疾病: {
      多发性硬化: {},
      视神经脊髓炎谱系疾病: {},
      急性播散性脑脊髓炎: {},
      其他中枢神经系统脱髓鞘病: {
        同心圆性硬化: {},
        自身免疫性星形胶质细胞病: {},
      },
      脑白质营养不良: {
        肾上腺脑白质营养不良: {},
        异染性脑白质营养不良: {},
      },
      脑桥中央髓鞘溶解症: {},
    },
    运动障碍性疾病: {
      帕金森病: {},
      帕金森叠加综合征: {
        多系统萎缩: {},
        进行性核上性麻痹: {},
      },
      肝豆状核变性: {},
      小舞蹈症: {},
      亨廷顿病: {},
      肌张力障碍: {},
      其他运动障碍性疾病: {
        原发性震颤: {},
        抽动秽语综合征: {},
        迟发性运动障碍: {},
      },
    },
    癫痫: {
      癫痫的分类: {},
      癫痫发作和癫痫综合征的临床表现: {},
      癫痫的诊断: {},
      癫痫的治疗及预后: {},
      癫痫持续状态: {},
    },
    脊髓疾病: {
      脊髓炎: {
        概述: {},
        急性脊髓炎: {},
      },
      脊髓压迫症: {},
      脊髓亚急性联合变性: {},
      脊髓蛛网膜炎: {},
      脊髓空洞症: {},
      脊髓血管病: {},
    },
    周围神经疾病: {
      脑神经疾病: {
        三叉神经痛: {},
        特发性面神经麻痹: {},
        面肌痉挛: {},
        多发性脑神经损害: {},
      },
      脊神经疾病: {
        单神经病及神经痛: {},
        多发性神经病: {},
        '吉兰-巴雷综合征': {},
        慢性炎性脱髓鞘性多发性神经根神经病: {},
      },
    },
    自主神经系统疾病: {
      雷诺病: {},
      红斑性肢痛症: {},
      面部偏侧萎缩症: {},
      其他自主神经系统疾病: {
        多汗症: {},
        血管神经性水肿: {},
        进行性脂肪营养不良: {},
      },
    },
    神经肌肉接头疾病和肌肉疾病: {
      重症肌无力: {},
      周期性瘫痪: {
        低钾型周期性瘫痪: {},
        高钾型周期性瘫痪: {},
        正常钾型周期性瘫痪: {},
      },
      特发性炎性肌病: {},
      进行性肌营养不良: {
        '发病机制、临床特点和辅助检查': {},
        诊断和鉴别诊断: {},
        治疗和预后: {},
      },
      强直性肌病: {
        强直性肌营养不良: {},
        先天性肌强直: {},
      },
    },
    神经系统遗传病: {
      遗传性共济失调: {
        脊髓小脑性共济失调: {},
        Friedreich共济失调: {},
      },
      遗传性痉挛性截瘫: {},
      腓骨肌萎缩症: {},
      神经皮肤综合征: {
        神经纤维瘤病: {},
        结节性硬化症: {},
        脑面血管瘤病: {},
      },
      线粒体病: {},
    },
    神经系统发育异常性疾病: {
      颅颈区畸形: {
        颅底凹陷症: {},
        小脑扁桃体下疝畸形: {},
      },
      脑性瘫痪: {},
      先天性脑积水: {},
    },
    睡眠障碍: {
      失眠障碍: {},
      发作性睡病: {},
      快速眼动睡眠行为障碍: {},
      不宁腿综合征: {},
    },
    内科系统疾病的神经系统并发症: {
      神经系统副肿瘤综合征: {
        中枢神经系统副肿瘤综合征: {},
        周围神经系统副肿瘤综合征: {},
        神经肌肉接头副肿瘤综合征: {},
      },
      糖尿病神经系统并发症: {
        糖尿病合并急性神经系统并发症: {},
        糖尿病合并慢性神经系统并发症: {},
      },
      系统性红斑狼疮的神经系统表现: {},
      甲状腺疾病神经系统并发症: {
        甲状腺功能亢进的神经系统病变: {},
        甲状腺功能减退性神经系统病变: {},
        桥本脑病: {},
      },
    },
    // 推荐阅读
  },

  // 中英文名词对照索引
  // 【数字特色：三维模型】
  // 三维模型1 大脑功能分区
  // 三维模型2 脑干结构
  // 三维模型3 脊髓结构
  // 三维模型4 全脑结构及神经血管
  // 三维模型5 脊髓皮节分布
  // 三维模型6 脊髓结构及病损表现
  // 【数字创新：虚拟仿真数字人】
  // 数字人案例1 闭目难立征阳性案例
  // 数字人案例2 急性脑梗死案例
  // 数字人案例3 周围性面瘫案例
}
